src/DataProcessors/ИС_Сбер_ВыгрузкаКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_Сбер_ВыгрузкаКарточек</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_Сбер_Фид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Сбер_Фид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>offer_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>available</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>category</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vendor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vendor_code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>model</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>old_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>picture</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>url</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_before</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>days</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИС_Сбер_ВыгрузкаКарточек/Forms/ФормаПредпросмотрXLSX/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьДанныеЭкспортаНаСервере()
	Инструкция.Очистить();
	СписокТоваров.Очистить();
	
	СтруктураОтветаФормирования = СформироватьДанныеXLSXФида(ЛичныйКабинет);
	СуществуютОшибкиЗаполнения = СтруктураОтветаФормирования.СуществуютОшибкиЗаполнения;
	Инструкция.Вывести(СтруктураОтветаФормирования.Инструкция);
	//СписокТоваров.Вывести(СтруктураОтветаФормирования.СписокТоваров);
	
	Элементы.ГруппаПодсказкаОбОшибках.Видимость = СуществуютОшибкиЗаполнения;
	Элементы.ГруппаПодсказкаОПроверке.Видимость = НЕ СуществуютОшибкиЗаполнения;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеЭкспорта(Команда)
	СформироватьДанныеЭкспортаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСтраницыЛистов.ТекущаяСтраница = Элементы.СтраницаСписокТоваров;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЛичныйКабинет") Тогда
		ЛичныйКабинет = Параметры.ЛичныйКабинет;
		СформироватьДанныеЭкспортаНаСервере();
	КонецЕсли;
КонецПроцедуры

#Область СохранениеВEXCEL

&НаКлиенте
Процедура ДалогСохраненияФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ИмяВыбранногоФайла = Результат[0];
		
		ПакетДанных = Новый ПакетОтображаемыхДокументов;
		
		ЭлементПакета = ПакетДанных.Состав.Добавить();
		ЭлементПакета.Наименование = "Инструкция";
		ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(Инструкция);
		
		ЭлементПакета = ПакетДанных.Состав.Добавить();
		ЭлементПакета.Наименование = "Список товаров";
		ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(СписокТоваров);
			    
	    ПакетДанных.НачатьЗапись(,ИмяВыбранногоФайла,ТипФайлаПакетаОтображаемыхДокументов.XLSX);
		
		ПоказатьОповещениеПользователя("Сформирован файл:"+Символы.ПС+ИмяВыбранногоФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДействияПользователяВВопросеСохранения(ОтветПользователя,ДопПараметр) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		УказаниеПутиСохраненияФайла();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УказаниеПутиСохраненияФайла()
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДВФ.Фильтр = "'Файл Excel'(*.xlsx)|*.xlsx";
	ДВФ.МножественныйВыбор = Ложь;
	ДВФ.Заголовок = "Сохранение сформированного фида Excel";
	
	ДВФ.Показать(Новый ОписаниеОповещения("ДалогСохраненияФайлаЗавершение", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВEXCEL(Команда)
	Если СуществуютОшибкиЗаполнения Тогда
		ОбработкаОповещенияОтветаНаВопрос = Новый ОписаниеОповещения("ОбработкаДействияПользователяВВопросеСохранения",ЭтаФорма);
		ПоказатьВопрос(ОбработкаОповещенияОтветаНаВопрос,"Сформированный документ содержит ошибки, продолжить сохранение?",РежимДиалогаВопрос.ДаНет);
	Иначе
		УказаниеПутиСохраненияФайла();
	КонецЕсли;
КонецПроцедуры  

Функция СформироватьДанныеXLSXФида(ЛичныйКабинет) Экспорт
	СуществуютОшибкиЗаполнения = Ложь;
	
	МакетИнструкции = Обработки.ИС_Сбер_ВыгрузкаКарточек.ПолучитьМакет("МакетИнструкция");
	МакетДанных = Обработки.ИС_Сбер_ВыгрузкаКарточек.ПолучитьМакет("МакетСписокТоваров");
	
	Инструкция = Новый ТабличныйДокумент;
	СписокТоваров = Новый ТабличныйДокумент;
	
	Инструкция.Вывести(МакетИнструкции);
	СписокТоваров.Вывести(МакетДанных.ПолучитьОбласть("Заголовок"));
	
	ОбластьСтрока = МакетДанных.ПолучитьОбласть("Строка");
	
	ВыборкаЗапроса = ПолучитьВыборкуДанныхФида(ЛичныйКабинет);
	СтруктураВалидации = Новый Структура;
	Пока ВыборкаЗапроса.Следующий() Цикл									
		
		instock = Макс(ВыборкаЗапроса.instock,0);
		
		СтруктураВалидации.Вставить("offer_id",		ВыборкаЗапроса.offer_id);
		СтруктураВалидации.Вставить("available",	?(ВыборкаЗапроса.available,"Доступен","Не доступен"));
		СтруктураВалидации.Вставить("category",		ВыборкаЗапроса.category);
		СтруктураВалидации.Вставить("vendor",		ВыборкаЗапроса.vendor);
		СтруктураВалидации.Вставить("vendor_code",	ВыборкаЗапроса.vendor_code);
		СтруктураВалидации.Вставить("model",		ВыборкаЗапроса.model);
		СтруктураВалидации.Вставить("name",			ВыборкаЗапроса.name);
		СтруктураВалидации.Вставить("price",		Формат(Окр(ВыборкаЗапроса.price,0,РежимОкругления.Окр15как20),"ЧГ=0"));
		СтруктураВалидации.Вставить("old_price",	Формат(Окр(ВыборкаЗапроса.old_price,0,РежимОкругления.Окр15как20),"ЧГ=0"));
		СтруктураВалидации.Вставить("instock",		?(instock=0,"0",Формат(instock,"ЧГ=0")));
		СтруктураВалидации.Вставить("vat",			ПолучитьПредставлениеСтавкиНДС(ВыборкаЗапроса.vat));
		СтруктураВалидации.Вставить("barcode",		ВыборкаЗапроса.barcode);
		СтруктураВалидации.Вставить("picture",		ВыборкаЗапроса.picture);
		СтруктураВалидации.Вставить("description",	ВыборкаЗапроса.description);
		СтруктураВалидации.Вставить("url",			ВыборкаЗапроса.url);
		СтруктураВалидации.Вставить("order_before",	ВыборкаЗапроса.order_before);
		СтруктураВалидации.Вставить("days",			ВыборкаЗапроса.days);
		
		Если НЕ СуществуютОшибкиЗаполнения Тогда
			СуществуютОшибкиЗаполнения = ПроверитьСтруктуруЭлементаНаНаличиеОшибок(СтруктураВалидации,СуществуютОшибкиЗаполнения);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,СтруктураВалидации);
		СписокТоваров.Вывести(ОбластьСтрока);
	КонецЦикла;                               
	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуществуютОшибкиЗаполнения",СуществуютОшибкиЗаполнения);
	СтруктураВозврата.Вставить("СписокТоваров",СписокТоваров);
	СтруктураВозврата.Вставить("Инструкция",Инструкция);
	
	Возврат СтруктураВозврата;
КонецФункции

Функция ПроверитьСтруктуруЭлементаНаНаличиеОшибок(СтруктураВалидации,СуществуютОшибкиЗаполнения)
	Попытка
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.offer_id));
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.category));
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.vendor));
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.vendor_code));
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.name));
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,?(ПустаяСтрока(СтруктураВалидации.price),0,Число(СтруктураВалидации.price))<0);
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,Число(СтруктураВалидации.instock)<0);
		//СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.barcode));
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.vat));
		СуществуютОшибкиЗаполнения = Макс(СуществуютОшибкиЗаполнения,ПустаяСтрока(СтруктураВалидации.model));
	Исключение
		СуществуютОшибкиЗаполнения = Истина;
		Сообщить("Ошибка валидации обязательных полей");
	КонецПопытки;
	
	Возврат СуществуютОшибкиЗаполнения;
КонецФункции

Функция ПолучитьВыборкуДанныхФида(ЛичныйКабинет)
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.УстановитьПараметр("ЛичныйКабинет",ЛичныйКабинет);
	ЗапросТоваров.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИС_Сбер_Фид.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ИС_Сбер_Фид КАК ИС_Сбер_Фид
		|ГДЕ
		|	ИС_Сбер_Фид.Профиль = &ЛичныйКабинет";
	ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать();
	МассивТоваров = Новый Массив;
	Пока ВыборкаТоваров.Следующий() Цикл
		МассивТоваров.Добавить(ВыборкаТоваров.Номенклатура);
	КонецЦикла;
	
	//Указание вида цен в поле old_price
	//Настройка_old_price = ЛичныйКабинет.НастройкаФидов.НастройкиПолей.Найти("old_price","Поле");
	//СписокВозможныхЦен = СформироватьСписокТекстовогоПредставленияВидовЦен();
	//ВероятныйЭлемент = СписокВозможныхЦен.НайтиПоЗначению(Настройка_old_price.Настройка);
	//Если ВероятныйЭлемент = Неопределено Тогда
	//	ЗначениеСтаройЦены = Неопределено;
	//Иначе
	//	ЗначениеСтаройЦены = ЗначениеИзСтрокиВнутр(ВероятныйЭлемент.Значение);
	//КонецЕсли;
	//	
	//ТаблицаЦен = Справочники.sberЛичныеКабинеты.СформироватьТаблицуСоответствияВидовЦенТовара(ЛичныйКабинет,МассивТоваров,ЗначениеСтаройЦены);	
	//
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ТаблицаЦен",ТаблицаЦен);
	
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Если НЕ ЛичныйКабинет.Пустая() Тогда
		Запрос.УстановитьПараметр("ЛичныйКабинет",	ЛичныйКабинет);
		//Запрос.УстановитьПараметр("Организация",	ЛичныйКабинет.Организация);
		//Запрос.УстановитьПараметр("Склады",			ЛичныйКабинет.Склады.ВыгрузитьКолонку("Склад"));
		Запрос.Текст = СформироватьЗапросСпискаТоваровФида();
	Иначе
		Запрос.УстановитьПараметр("ЛичныйКабинет",	Неопределено);
		//Запрос.УстановитьПараметр("Организация",	Неопределено);
		//Запрос.УстановитьПараметр("Склады",			Новый Массив);
		Запрос.Текст = СформироватьЗапросСпискаТоваровФида();
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция СформироватьЗапросСпискаТоваровФида() 
	
	ТекстЗапроса = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	Набор.Номенклатура КАК Номенклатура,
	//|	0 КАК ВНаличии,
	//|	0 КАК ВРезервеСоСклада,
	//|	0 КАК ВРезервеПодЗаказ,
	//|	0 КАК КОтгрузке
	//|ПОМЕСТИТЬ ВтСводныеОстатки
	//|	ИЗ
	//|		РегистрНакопления.ТоварыКОтгрузке.Остатки(&ТекДата) КАК ТоварыКОтгрузке) КАК Набор
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Набор.Номенклатура
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВтСводныеОстатки.Номенклатура КАК Номенклатура,
	//|	ВтСводныеОстатки.ВНаличии - ВтСводныеОстатки.ВРезервеСоСклада - ВтСводныеОстатки.ВРезервеПодЗаказ - ВтСводныеОстатки.КОтгрузке КАК Остаток
	//|ПОМЕСТИТЬ пред_ОстаткиНоменклатуры
	//|ИЗ
	//|	ВтСводныеОстатки КАК ВтСводныеОстатки
	//|;
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ 
	//|	пред_ОстаткиНоменклатуры.Номенклатура КАК Номенклатура,
	//|	ВЫРАЗИТЬ(пред_ОстаткиНоменклатуры.Остаток КАК Число(16,0)) КАК Остаток
	//|ПОМЕСТИТЬ ОстаткиНоменклатуры
	//|ИЗ пред_ОстаткиНоменклатуры КАК пред_ОстаткиНоменклатуры;
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ 
	//|	ТаблицаЦен.Номенклатура	КАК Номенклатура,
	//|	ТаблицаЦен.Цена			КАК Цена
	//|ПОМЕСТИТЬ ЦеныНоменклатуры
	//|ИЗ
	//|	&ТаблицаЦен КАК ТаблицаЦен
	//|;
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	sberСведенияФидов.Номенклатура			КАК Номенклатура,
	//|	sberСведенияФидов.ЛичныйКабинет			КАК ЛичныйКабинет,
	//|	0										КАК Остаток,
	//|	МАКСИМУМ(ЦеныНоменклатуры.Цена) 		КАК Цена
	//|ПОМЕСТИТЬ ОбщаяВыборка
	//|ИЗ
	//|	РегистрСведений.sberСведенияФидов КАК sberСведенияФидов
	//|	ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	//|		ПО sberСведенияФидов.Номенклатура = ЦеныНоменклатуры.Номенклатура
	//|ГДЕ
	//|	sberСведенияФидов.ЛичныйКабинет = &ЛичныйКабинет
	//|СГРУППИРОВАТЬ ПО 
	//|	sberСведенияФидов.Номенклатура,
	//|	sberСведенияФидов.ЛичныйКабинет,
	//|	ЕСТЬNULL(ОстаткиНоменклатуры.Остаток,0)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	"ВЫБРАТЬ
	|	sberСведенияФидов.Профиль КАК ЛичныйКабинет,
	|	sberСведенияФидов.Номенклатура КАК Номенклатура,
	|	sberСведенияФидов.offer_id КАК offer_id,
	|	sberСведенияФидов.available КАК available,
	|	sberСведенияФидов.category КАК category,
	|	sberСведенияФидов.vendor КАК vendor,
	|	sberСведенияФидов.vendor_code КАК vendor_code,
	|	sberСведенияФидов.model КАК model,
	|	sberСведенияФидов.name КАК name,
	|	sberСведенияФидов.vat КАК vat,
	|	sberСведенияФидов.old_price КАК old_price,
	|	sberСведенияФидов.barcode КАК barcode,
	|	sberСведенияФидов.picture КАК picture,
	|	sberСведенияФидов.description КАК description,
	|	sberСведенияФидов.url КАК url,
	|	sberСведенияФидов.order_before КАК order_before,
	|	sberСведенияФидов.days КАК days,
	|	sberСведенияФидов.price КАК price,
	|	0 КАК instock
	|ИЗ
	|	РегистрСведений.ИС_Сбер_Фид КАК sberСведенияФидов
	|ГДЕ
	|	sberСведенияФидов.Профиль = &ЛичныйКабинет";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьПредставлениеСтавкиНДС(Ставка) Экспорт
	Представление = "Не облагается";
	Если Ставка = Неопределено ИЛИ Ставка.Пустая() Тогда
		Представление = "Не облагается";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС20 Тогда
		Представление = "20";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Представление = "20";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС10 Тогда
		Представление = "10";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Представление = "10";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС0 Тогда
		Представление = "Не облагается";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.БезНДС Тогда
		Представление = "Не облагается";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС18 Тогда
		Представление = "20";
	ИначеЕсли Ставка = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Представление = "20";
	КонецЕсли;
	
	Возврат Представление;
КонецФункции    

#КонецОбласти
